# Homebrew formulas sourced from `brew leaves`.
# Compulsory casks are included for bootstrap.

tap "teamookla/speedtest"

brew "ansible"
brew "axel"
brew "bash"
brew "chezmoi"
brew "displayplacer"
brew "dockutil"
brew "ffmpeg"
brew "httrack"
brew "mas"
brew "masscan"
brew "mtr"
brew "nmap"
brew "node"
brew "poppler"
brew "python@3.13"
brew "shellcheck"
brew "teamookla/speedtest/speedtest"
brew "wireguard-tools"
brew "yt-dlp"

# Compulsory casks
cask "1password"
cask "appcleaner"
cask "applite"
cask "chatgpt"
cask "coconutbattery"
cask "codex-app"
cask "desktoppr"
cask "fastmail"
cask "firefox"
cask "github"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "keka"
cask "omnidisksweeper"
cask "plexamp"
cask "spotify"
cask "synology-drive"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
